import { SafeAreaView, ScrollView, StyleSheet, Text, View,Image } from "react-native";
import React from "react";

const HelpScreen = () => {
  return (
    <SafeAreaView>
       <ScrollView>

        <View>
        <Image
          source={require('../../assets/Nhelp.jpeg')}
           style={styles.CoverImgHelpSectionStyle}
           resizeMode="center"
      />
        </View>
    <Text style={styles.ContextStyle}>

       {'\n'}<Text style={styles.QuestionStyle}>প্রশ্নঃ সাইট টি কিভাবে কাজ করে?</Text>{'\n'}

     <Text>উত্তরঃ প্রথমে আমাদের সাইট www.tcm-bd.com এ যাবেন, সেখানে অনুসন্ধান বার এ আপনার প্রয়োজনীয় 

      পণ্যটির নাম লিখার সাথে সাথেই পণ্যটি আপনার সামনে ভেসে উঠবে। এবার পণ্যটি খুব সহজেই আপনার 
      শপিং ব্যাগ এ এড করতে পারবেন – আপনার প্রয়োজনীয় সকল পণ্য আপনার ব্যাগ এ নেওয়া শেষ হলে  
      আপনার ঠিকানা এবং নির্দিষ্ট ডেলিভারী সময়টি ঠিক করলেই আপনার অর্ডার টি আমাদের নিকট পৌঁছে যাবে
      এবং আপনি আমাদের একজন প্রতিনিধি আপনাকে ফোন করে অর্ডার এর স্বকীয়তা যাচাই করবে। এবং 
      তারপর আপনার কাছে আমাদের ডেলিভারী প্রতিনিধি এসে আপনার বাজার টি দিয়ে যাবে। {'\n'}{'\n'}</Text>

      <Text style={styles.QuestionStyle}>প্রশ্নঃ ডেলিভারী চার্জ কত? </Text> {'\n'}

      <Text>উত্তরঃ আমাদের ডেলিভারি ফি হচ্ছে:{'\n'}{'\n'}

           
            অর্ডার মূল্য ৪০০ এর কম | অর্ডার মূল্য ৪০০ এর বেশি |{'\n'}
           
                  {'\n'}ঢাকা ৪৯               |           ৩৯                             
           
     </Text>{'\n'}{'\n'}




     <Text style={styles.QuestionStyle}>প্রশ্নঃ যোগাযোগ এর উপায় কি? </Text>{'\n'}

    <Text>উত্তরঃ আপনি ফোন এ যোগাযোগ করতে ১৬৭১০ এই নাম্বার এবং মেইল করুন support@tcmbd.com । </Text>{'\n'}{'\n'}

    <Text style={{fontWeight:"700",fontSize:16}}>প্রশ্নঃ বাজারটি আসতে কত সময় লাগতে পারে? </Text>{'\n'}

    <Text>উত্তরঃ আমরা  উত্তরখান, দক্ষিন খান এরিয়াগুলোতে ১ ঘন্টা* 
     সময়ে মাঝে ডেলিভারী করি। তবে
     আপনি আপনার সুবিধা অনুযায়ী ডেলিভারীর যে কোন একটি সময় বেঁছে নিতে পারেন।</Text>{'\n'}{'\n'}


<Text style={styles.QuestionStyle}>প্রশ্নঃ বাজারটি যে পৌঁছেছে এই তথ্য কিভাবে পাব? </Text>
{'\n'}

 <Text>উত্তরঃ আমাদের TCM-BD প্রতিনিধি আপনাকে ফোন দিয়ে জানিয়ে দিবে ডেলিভারী এর অবস্থান সম্পর্কে। </Text>{'\n'}{'\n'}


 <Text style={styles.QuestionStyle}>প্রশ্নঃ মূল্য পরিশোধ উপায় কি? </Text>{'\n'}

         <Text>উত্তরঃ আপনি ডেলিভারীর সময় পণ্য যাচাই করে মূল্য পরিশোধ করতে পারবেন। এছাড়া 
        অনলাইনে ক্রেডিট কার্ড অথবা বিকাশের মাধ্যমেও মূল্য পরিশোধ করতে পারবেন।
 এছাড়া প্রবাসীরা PayPal এর মাধ্যমে দেশের বাহির থেকে ঢাকার স্থায়ী আপনজনের হয়ে মূল্য পরিশোধ করতে পারবে।  </Text>{'\n'}{'\n'}




 <Text style={styles.QuestionStyle}>প্রশ্নঃ আমাদের এলাকাতে কি বাজার ডেলিভারী হয়? </Text>{'\n'}

         <Text>উত্তরঃ আমরা উত্তরার সকল এলাকাতে ডেলিভারী করে থাকি। </Text>{'\n'}{'\n'}


      <Text style={styles.QuestionStyle}>প্রশ্নঃ আমি আমার প্রয়োজনীয় একটি পণ্য সাইট এ খুঁজে পাচ্ছি না,
       কি করবো? </Text>{'\n'}

       <Text>উত্তরঃ আপনার কোন পণ্য যদি সাইট খুঁজে না পান, সেইখেত্রে আপনি আমাদের কে পণ্যটির তথ্যাদি দিয়ে
        ১০১০১০ নাম্বারে কল করে জানাতে পারেন অথবা মেইল করতে পারেন support@tcmbd.com এ। 
        আমরা আপনার জন্য পণ্যটি স্টকে আনার চেষ্টা করব। </Text>{'\n'}{'\n'}



        <Text style={styles.QuestionStyle}>প্রশ্নঃ বাজারে কিছু সমস্যা দেখা দিয়েছে, কি করতে পারি?</Text> {'\n'}

<Text>উত্তরঃ যেকোনো ধরনের সমস্যার জন্য ১০১০১০ এই নাম্বার। আমাদের একজন প্রতিনিধি  সকল সমস্যার 
  সমাধানে সর্বদা নিয়োজিত আছে। </Text>{'\n'}{'\n'}


<Text style={styles.QuestionStyle}>প্রশ্নঃ হরতাল এ কি ডেলিভারী হয়? </Text>{'\n'}

<Text>উত্তরঃ জ্বী, আমাদের লক্ষ্যই হল আপনাদের বাজারের সকল দুশ্চিন্তা দূর করা। </Text>{'\n'}{'\n'}


<Text style={styles.QuestionStyle}>প্রশ্নঃ এলাকার দোকান বাদ দিয়ে আপনাদের থেকে নিব কেন? </Text>{'\n'}

<Text>উত্তরঃ সময় বাঁচান, আপনার অবসর সময়ের মূল্য আমরা বুঝি। সময়টি যাতে আপনি আপনার পরিবার-পরিজন 
  এর সাথে ব্যয় করতে পারেন সেই সুযোগ করে দেওয়াই আমাদের লক্ষ্য। এছাড়া শহরের অন্যান্য সুপার স্টোর গুলোর 
  চেয়ে আমাদের সাইটে পণ্যের দাম কম এবং আপনার বাসার পাশের মুদি দোকানের চেয়ে বেশি পণ্য আমাদের কাছ
   থেকে পাবেন। তাহলে কেন কষ্ট করে আর বাজার যাওয়া? </Text>{'\n'}{'\n'}


<Text style={styles.QuestionStyle}>প্রশ্নঃ দ্রব্যমূল্য কত বেশি? </Text>{'\n'}

 <Text>উত্তরঃ আমাদের পন্যের দর বাজারে প্রচলিত মুল্যের এর সমান অথবা কাছাকাছি। এবং কোন ধরনের অতিরিক্ত কর মুক্ত।  </Text>{'\n'}{'\n'}


<Text style={styles.QuestionStyle}>প্রশ্নঃ আপনারা কিভাবে ডেলিভারী করে থাকেন?  </Text>{'\n'}

<Text>উত্তরঃ আমাদের নিজস্ব বাহন রয়েছে এবং আমরা সরবারহ ব্যবস্থাপনায় স্বয়ংসম্পূর্ণ।
   তবে আমাদের ডেলিভারী প্রতিনিধিরা যেকোনো উপায় আপনার বাজার আপনার নিকট পৌঁছে দেওয়ার প্রশিক্ষণপ্রাপ্ত।  </Text>{'\n'}{'\n'}


<Text style={styles.QuestionStyle}>প্রশ্নঃ পণ্য ফেরত এর কোন সুযোগ আছে কি?  </Text>{'\n'}

 <Text>উত্তরঃ আমরা সাত (৭) দিনের মধ্যে পণ্য ফেরত দেওয়ার  সুবিধা প্রদান করে থাকি যদি সেই পণ্য খোলা বা নষ্ট না হয়ে থাকে। 
  পচনশীল পণ্য যেমন, দুধ, ফলমূল এবং শাকসবজি এর ক্ষত্রে এক (১) দিনের মধ্যে পণ্য ফেরত দেওয়ার সুবিধা রয়েছে। 
  ডায়াপারের ক্ষত্রে ১০% বা ৩ পিস্ ব্যবহার করে ফেলার পূর্বে রিফান্ডের জন্য ফেরত দিতে হবে। 
  নির্দিষ্ট পণ্য; ফেস মাস্ক, ডিসপোজেবল গ্লাভস, অ্যালকোহল প্যাড এবং কোভিড টেস্টিং কিট খোলা বা না-খোলা 
  কোনো ক্ষেত্রেই ফেরত যোগ্য হবে না।
  পণ্য রিফান্ড না প্রদানের সর্বস্বত্ব অধিকার আমাদের আছে। যে কোনো পণ্য ফেরত দিতে সরাসরি যোগাযোগ করুন ১০১০১০ নম্বরে। </Text>{'\n'}{'\n'}


<Text style={styles.QuestionStyle}>প্রশ্নঃ টাকায় রিফান্ড কি পাওয়া যাবে?  </Text>{'\n'}

<Text>উত্তরঃ না, যেকোনো ধরনের সমস্যায় আমরা আপনার TCM-BD একাঊন্টটি
 তৎক্ষণাৎ ক্রেডিট দিয়ে আপডেট করবো। </Text>{'\n'} {'\n'}




  <Text style={styles.QuestionStyle}>প্রশ্নঃ ফোন এ কি অর্ডার করা যায়? </Text>{'\n'} 

  <Text>উত্তরঃ অবশ্যই, ফোন এ অর্ডার করতে আপনি কল করতে পারেন ১০১০১০ এই নাম্বারে। </Text>{'\n'} {'\n'}


  <Text style={styles.QuestionStyle}>প্রশ্নঃ পন্যের গুনগত মান কেমন? </Text>{'\n'} 

  <Text> উত্তরঃ আমরা আমাদের সকল পণ্য হয় সরাসরি উৎপাদনকারীদের থেকে সংগ্রহ করা হয়, 
    অথবা অত্যন্ত বিশ্বস্ত জায়গা থেকে সংগ্রহীত হয়। তবুও যদি আমরা গ্রাহকদের সন্তুষ্ট করতে ব্যর্থ হই,
     তাহলে যেকোনো পণ্য ৭ দিনের মাঝে অবশ্যই ফেরতযোগ্য। </Text>{'\n'} {'\n'}


 <Text style={styles.QuestionStyle}>প্রশ্নঃ ডেলিভারি প্রতিনিধিকে কি কোন বকশিশ দিতে হবে? </Text>{'\n'} 

 <Text> উত্তরঃ বকশিশ দেওয়া আবশ্যক নয়। তবে আমাদের ডেলিভারী প্রতিনিধিরা তাদের পরিশ্রমের স্বীকৃতি
   পেলে উৎসাহিত হয়। এবং বকশিশ এর পুরো পরিমাণটি তারাই উপভোগ করে থাকে। </Text>{'\n'} {'\n'}


<Text style={styles.QuestionStyle}>প্রশ্নঃ আমার একাউন্ট কিভাবে ডিলিট করব?</Text>{'\n'} 

 <Text>উত্তরঃ আপনি শুধুমাত্র একটি অ্যান্ড্রয়েড বা আইওএস অ্যাপের মাধ্যমে একটি চালডাল একাউন্ট 
  ডিলিট করতে পারবেন। প্রোফাইল বিভাগে গিয়ে নিচের দিকে 
  সেখানে আপনার একাউন্ট ডিলিট করার অপশন পাবেন।</Text>{'\n'} {'\n'}


<Text style={styles.QuestionStyle}>প্রশ্নঃ অ্যাকাউন্ট ডিলিট করলে কি হবে?</Text>{'\n'} 

<Text> উত্তরঃ যদি আপনার একাউন্ট ডিলিট করেন:
আপনার সমস্ত ব্যক্তিগত এবং একাউন্ট সম্পর্কিত তথ্য মুছে ফেলা হবে এবং কোন উপায়ে তা পাওয়া যাবে না।
এই প্রক্রিয়াটি পুনরায় ফেরানো যাবে না।</Text>{'\n'} {'\n'}


 <Text style={styles.QuestionStyle}>প্রশ্নঃ অ্যাকাউন্ট ডিলিট করতে কতদিন লাগবে?</Text>{'\n'} 

 <Text> উত্তরঃ অ্যাকাউন্ট ডিলিট করার প্রথম দিন থেকে আপনার কাছে ৩০ দিন ধরে রাখার সময় থাকবে। আপনি 
  যদি ধরে রাখার সময়কালে আপনার অ্যাকাউন্টে লগইন করেন তবে আপনার অ্যাকাউন্টের সমস্ত তথ্য এক্সেস করতে
   পারবেন কিন্তু ৩০ দিন পর আপনার তথ্য ডিলিট করে ফেলা হবে।</Text>{'\n'}{'\n'} 

  </Text>


   
      
       </ScrollView>
    </SafeAreaView>
  );
};

export default HelpScreen;

const styles = StyleSheet.create({

  CoverImgHelpSectionStyle:{
    height: 200,    
    flex: 1,
    justifyContent: 'center',
    alignItems: 'center',
    width:"100%"
  },

  QuestionStyle:{
    fontWeight:"700",
    fontSize:16
  },

  ContextStyle:{
    marginHorizontal:10,
    textAlign:"justify",
    fontWeight:"400",
    fontSize:14
  }
});
